1314mjf521/ESP8266/src/main_V1.0.1.cpp
/*
 * 项目名称: ESP8266 步进电机远程控制系统
 * Project Name: ESP8266 Stepper Motor Remote Control System
 *
 * 功能描述 (Function Description):
 * 1. 支持通过物理按钮控制步进电机的开关和方向。
 *    Supports physical buttons to control the motor's on/off state and direction.
 * 2. 支持通过网页接口控制电机的开关和方向。
 *    Provides a web interface to control the motor's on/off state and direction.
 * 3. 支持通过MQTT协议实现远程控制和状态上报。
 *    Enables remote control and status reporting via MQTT protocol.
 * 4. 支持智能配网功能，用户无需硬编码WiFi信息。
 *    Includes smart configuration for WiFi, eliminating the need for hardcoded credentials.
 * 5. 支持OTA(Over-The-Air)升级功能，方便远程更新固件。
 *    Supports OTA (Over-The-Air) updates for convenient firmware upgrades.
 *
 * 功能特点 (Features):
 * - 简单易用，适合初学者快速上手。
 *   Simple and user-friendly, suitable for beginners.
 * - 支持多种控制方式：物理按钮、网页接口、MQTT协议。
 *   Supports multiple control methods: physical buttons, web interface, and MQTT protocol.
 * - 高度可扩展，可根据需求添加更多功能。
 *   Highly extensible, allowing for additional features as needed.
 * - 提供详细的中英双语注释，便于理解和调试。
 *   Includes detailed bilingual comments for better understanding and debugging.
 */

 #include <ESP8266WiFi.h>
 #include <PubSubClient.h>
 #include <ESP8266WebServer.h>
 #include <WiFiManager.h> // 智能配网库 / Smart configuration library
 #include <ArduinoOTA.h> // OTA升级库 / OTA update library
 #include <EEPROM.h> // 引入EEPROM库，用于保存MQTT地址
 #include <ESP8266HTTPClient.h> // 引入HTTPClient库，用于远程OTA升级
 #include <map> // 引入map库，用于存储控制端信息 / Include map library for storing client info
 #include <BasicStepperDriver.h> // 替换为正确的头文件
 
 
 #define EEPROM_SIZE 512 // 定义EEPROM大小
 #define MQTT_ADDRESS_OFFSET 0 // MQTT地址在EEPROM中的起始位置
 #define MQTT_ADDRESS_MAX_LENGTH 100 // MQTT地址的最大长度
 
 char mqtt_server[MQTT_ADDRESS_MAX_LENGTH] = "192.168.1.100"; // 默认MQTT服务器地址
 
 ESP8266WebServer server(80); // 确保 server 的声明在所有函数之前
 WiFiClient espClient; // 确保 espClient 的声明在所有函数之前
 PubSubClient client(espClient); // 确保 client 的声明在所有函数之前
 
 // 函数声明 / Function declarations
 void handleRoot(); // 处理主页请求 / Handle root request
 void handleMotorOn(); // 处理开启电机请求 / Handle motor on request
 void handleMotorOff(); // 处理关闭电机请求 / Handle motor off request
 void handleMotorDirection(); // 处理切换电机方向请求 / Handle motor direction toggle request
 void handleMotorAPI(); // 处理电机控制API请求 / Handle motor control API request
 void handleVersionInfo(); // 处理获取版本信息请求 / Handle version info request
 void reconnectMQTT(); // MQTT重连函数 / MQTT reconnect function
 void handlePhysicalButtons(); // 处理物理按钮逻辑 / Handle physical button logic
 void handleMQTTMotorControl(String message); // 处理MQTT消息：电机控制 / Handle MQTT message: motor control
 void handleOTA(); // 处理OTA升级请求 / Handle OTA upgrade request
 void handleOTAUpload(); // 处理OTA文件上传 / Handle OTA file upload
 void handleOTARemote(); // 处理远程OTA升级 / Handle remote OTA upgrade
 void handleToggleMQTTControl(); // 处理启用或禁用MQTT控制的请求 / Handle enable or disable MQTT control
 void handleDeviceInfo(); // 处理设备信息请求 / Handle device info request
 void handleSetMotorRunDuration(); // 处理设置电机启动时长的网页请求 / Handle web request to set motor run duration
 void handleMotorButton(); // 处理电机按钮逻辑 / Handle motor button logic
 void handleMotorRunDuration(); // 处理电机运行时长逻辑 / Handle motor run duration logic
 void handleClientsPage(); // 处理控制端信息页面请求 / Handle client info page request
 void handleSetClientName(); // 处理设置控制端名称的请求 / Handle set client name request
 void updateClientOnlineStatus(String mac); // 更新控制端在线状态 / Update client online status
 void handleResetWiFi(); // 处理重新配网请求 / Handle reset WiFi request
 void handleSpeedUp(); // 处理加速请求 / Handle speed up request
 void handleSlowDown(); // 处理减速请求 / Handle slow down request
 void initializeMotorPwm(); // 声明初始化电机PWM信号的函数 / Declare the function to initialize motor PWM signal
 
 // WiFi连接失败计数器 / WiFi connection failure counter
 int wifiConnectFailures = 0;
 
 // 加载保存的MQTT地址 / Load the saved MQTT address from EEPROM
 void loadMQTTAddress() {
   EEPROM.begin(EEPROM_SIZE); // 初始化EEPROM / Initialize EEPROM
   for (int i = 0; i < MQTT_ADDRESS_MAX_LENGTH; i++) {
     mqtt_server[i] = EEPROM.read(MQTT_ADDRESS_OFFSET + i); // 从EEPROM读取字符 / Read characters from EEPROM
     if (mqtt_server[i] == '\0') break; // 遇到字符串结束符停止读取 / Stop reading at null terminator
   }
   if (mqtt_server[0] == '\0') {
     strcpy(mqtt_server, "192.168.1.100"); // 如果未设置地址，使用默认值 / Use default if no address is set
   }
   Serial.println("加载的MQTT地址: " + String(mqtt_server)); // 打印加载的地址 / Print the loaded address
 }
 
 // 保存MQTT地址到EEPROM / Save the MQTT address to EEPROM
 void saveMQTTAddress(const char* address) {
   for (int i = 0; i < MQTT_ADDRESS_MAX_LENGTH; i++) {
     EEPROM.write(MQTT_ADDRESS_OFFSET + i, address[i]); // 写入字符到EEPROM / Write characters to EEPROM
     if (address[i] == '\0') break; // 遇到字符串结束符停止写入 / Stop writing at null terminator
   }
   EEPROM.commit(); // 提交更改 / Commit changes
   Serial.println("保存的MQTT地址: " + String(address)); // 打印保存的地址 / Print the saved address
 }
 
 // 处理设置MQTT地址的网页请求 / Handle web request to set MQTT address
 void handleSetMQTTAddress() {
   if (server.hasArg("address")) { // 检查是否提供了地址参数 / Check if address parameter is provided
     String address = server.arg("address");
     if (address.length() < MQTT_ADDRESS_MAX_LENGTH) {
       address.toCharArray(mqtt_server, MQTT_ADDRESS_MAX_LENGTH); // 将地址转换为字符数组 / Convert address to char array
       saveMQTTAddress(mqtt_server); // 保存地址到EEPROM / Save address to EEPROM
       client.setServer(mqtt_server, 1883); // 更新MQTT服务器地址 / Update MQTT server address
       Serial.printf("MQTT地址已更新为: %s / MQTT address updated to: %s\n", mqtt_server, mqtt_server);
       server.send(200, "text/plain; charset=utf-8", "MQTT地址已更新 / MQTT address updated");
     } else {
       server.send(400, "text/plain; charset=utf-8", "地址过长 / Address too long");
       Serial.println("设置MQTT地址失败：地址过长 / Failed to set MQTT address: Address too long");
     }
   } else {
     server.send(400, "text/plain; charset=utf-8", "缺少地址参数 / Missing address parameter");
     Serial.println("设置MQTT地址失败：缺少地址参数 / Failed to set MQTT address: Missing address parameter");
   }
 }
 
 // 检查是否定义了引脚宏，如果未定义则手动定义
 #ifndef D1
 #define D1 4 // 替换为实际的 GPIO 编号
 #endif
 #ifndef D2
 #define D2 5 // 替换为实际的 GPIO 编号
 #endif
 #ifndef D3
 #define D3 16 // 替换为实际的 GPIO 编号
 #endif
 #ifndef D4
 #define D4 14 // 替换为实际的 GPIO 编号
 #endif
 #ifndef D5
 #define D5 12 // 替换为实际的 GPIO 编号
 #endif
 #ifndef D6
 #define D6 13 // 替换为实际的 GPIO 编号闲置引脚暂未使用
 #endif
 
// 引脚定义区域 / Pin definitions
// =============================
// 步进电机控制引脚定义 / Stepper motor control pin definitions
#define DIR_PIN D1  // 方向控制引脚 / Direction control pin
#define STEP_PIN D2 // 步进控制引脚 / Step control pin
#define ENABLE_PIN D3 // 使能引脚 / Enable pin

// 电机开关及限位按钮引脚定义 / Motor toggle and limit switch pin definition
#define MOTOR_BUTTON_PIN D4 // 电机开关及限位按钮引脚 / Motor toggle and limit switch pin

// 物理按钮引脚定义 / Physical button pin definitions
#define BUTTON_DIRECTION_PIN D5 // 电机方向按钮引脚 / Motor direction button pin

