1314mjf521/ESP8266/src/main_V1.0.1.cpp
// 板载 LED 引脚定义 / Onboard LED pin definition
#ifndef LED_BUILTIN
#define LED_BUILTIN 2 // 通常 ESP8266 的板载 LED 位于 GPIO 2 / Typically onboard LED is on GPIO 2
#endif
// =============================

// 按钮状态变量 / Button state variables
bool lastMotorButtonState = HIGH; // 上一次读取的电机按钮状态 / Last read state of the motor button
unsigned long lastMotorButtonDebounceTime = 0; // 防抖时间戳 / Debounce timestamp
const unsigned long motorButtonDebounceDelay = 50; // 防抖延迟（毫秒） / Debounce delay (milliseconds)

bool lastEnableButtonState = HIGH; // 上一次读取的电机开关按钮状态 / Last read state of the motor on/off button
bool lastDirectionButtonState = HIGH; // 上一次读取的电机方向按钮状态 / Last read state of the motor direction button
unsigned long lastDebounceTime = 0; // 防抖时间戳 / Debounce timestamp
const unsigned long debounceDelay = 50; // 防抖延迟（毫秒） / Debounce delay (milliseconds)

// MQTT主题定义 / MQTT topic definitions
 const char* mqtt_topic_motor_control = "motor/control"; // 电机控制主题 / Motor control topic
 const char* mqtt_topic_status_report = "motor/status";  // 状态上报主题 / Status report topic
 
 // 电机状态变量 / Motor state variables
 bool motorEnabled = false; // 电机是否开启 / Whether the motor is enabled
 bool motorDirection = true; // 电机方向：true为正转，false为反转 / Motor direction: true for forward, false for reverse
 
 // 电机启动时长（毫秒） / Motor run duration (milliseconds)
 unsigned long motorRunDuration = 10000; // 默认10秒 / Default 10 seconds
 unsigned long motorStartTime = 0; // 电机启动时间戳 / Motor start timestamp
 
 // 电机未使用超时时间（毫秒） / Motor inactivity timeout (milliseconds)
 const unsigned long motorInactivityTimeout = 5 * 60 * 1000; // 5 分钟 / 5 minutes
 unsigned long lastMotorActivityTime = 0; // 上次电机操作时间戳 / Last motor activity timestamp
 
 // 定义版本号 / Define version number
 #define FIRMWARE_VERSION "1.0.2"
 
 // 控制端上线标志 / Controller online flag
 bool controllerOnline = false;
 
 // 控制端检测的时间间隔（毫秒） / Controller detection interval (milliseconds)
 const unsigned long controllerCheckInterval = 5000; // 每5秒检测一次 / Check every 5 seconds
 unsigned long lastControllerCheckTime = 0; // 上次检测时间戳 / Last check timestamp
 
 // 控制端信息存储 / Client information storage
 std::map<String, String> clients; // 存储控制端MAC地址和名称 / Store client MAC address and name
 
 // 动态记录控制端MAC地址 / Dynamically record controller MAC addresses
 void handleRegisterController() {
   String macAddress = WiFi.macAddress();
   Serial.println("控制端已注册，MAC地址: / Controller registered, MAC address: " + macAddress);
   controllerOnline = true; // 设置控制端上线标志 / Set controller online flag
   server.send(200, "text/plain", "控制端已注册 / Controller registered");
 }
 
 // MQTT消息回调函数声明 / MQTT message callback function declaration
 void mqttCallback(char* topic, byte* payload, unsigned int length);
 
 // 定义MQTT重连的时间间隔（毫秒） / Define MQTT reconnect interval (milliseconds)
 const unsigned long mqttReconnectInterval = 5000; // 每5秒尝试一次 / Retry every 5 seconds
 unsigned long lastMQTTReconnectAttempt = 0; // 上次尝试时间戳 / Last reconnect attempt timestamp
 
 // MQTT控制启用标志 / MQTT control enable flag
 bool mqttControlEnabled = false; // 默认禁用MQTT控制 / Default to disabled
 
 // MQTT重连函数 / MQTT reconnect function
 void reconnectMQTT() {
   if (!mqttControlEnabled) {
     Serial.println("MQTT控制已禁用，跳过重连 / MQTT control disabled, skipping reconnect");
     return;
   }
 
   if (client.connected()) return; // 如果已连接，直接返回 / Return if already connected
 
   unsigned long now = millis();
   if (!controllerOnline) {
     // 限制串口输出频率 / Limit serial output frequency
     if (now - lastControllerCheckTime >= controllerCheckInterval) {
       lastControllerCheckTime = now; // 更新上次检测时间戳 / Update last check timestamp
       Serial.println("控制端未上线，跳过MQTT连接 / Controller not online, skipping MQTT connection");
     }
     return;
   }
 
   if (now - lastMQTTReconnectAttempt >= mqttReconnectInterval) {
     lastMQTTReconnectAttempt = now; // 更新上次尝试时间戳 / Update last attempt timestamp
     Serial.print("尝试连接MQTT服务器... / Attempting to connect to MQTT server...");
     if (client.connect("ESP8266Client")) {
       Serial.println("连接成功 / Connected");
       client.subscribe(mqtt_topic_motor_control); // 订阅电机控制主题 / Subscribe to motor control topic
     } else {
       Serial.print("连接失败，状态码= / Connection failed, state=");
       Serial.println(client.state());
     }
   }
 }
 
 // 嵌入的HTML内容 / Embedded HTML content
 const char MAIN_HTML[] PROGMEM = R"rawliteral(
 <!DOCTYPE html>
 <html>
 <head>
   <meta charset="UTF-8">
   <title>ESP8266 步进电机控制系统</title>
   <style>
     body { font-family: Arial, sans-serif; text-align: center; margin: 20px; }
     h1 { color: #333; }
     button, input[type="text"], input[type="number"] { padding: 10px 20px; margin: 10px; font-size: 16px; }
     button { background-color: #4CAF50; color: white; border: none; cursor: pointer; }
     button:hover { background-color: #45a049; }
     input[type="text"], input[type="number"] { width: 300px; }
     .info { margin: 20px; font-size: 18px; }
     .button-group { margin: 20px; }
   </style>
   <script>
     // 加载设备信息 / Load device information
     function loadDeviceInfo() {
       fetch('/api/device_info')
         .then(response => response.json())
         .then(data => {
           document.getElementById('ipAddress').innerText = data.ip;
           document.getElementById('macAddress').innerText = data.mac;
           document.getElementById('version').innerText = data.version;
           document.getElementById('onlineClients').innerText = data.onlineClients;
         })
         .catch(() => alert('无法加载设备信息 / Failed to load device information'));
     }
 
     // 设置电机启动时长 / Set motor run duration
     function setMotorDuration() {
       const duration = document.getElementById('motorDuration').value;
       fetch(`/api/set_motor_duration?duration=${duration}`)
         .then(response => {
           if (response.ok) {
             alert('电机启动时长已更新！ / Motor run duration updated!');
           } else {
             alert('设置失败，请检查输入值 / Failed to set duration, please check the input value');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 设置MQTT地址 / Set MQTT address
     function setMQTTAddress() {
       const address = document.getElementById('mqttAddress').value;
       fetch(`/api/set_mqtt?address=${encodeURIComponent(address)}`)
         .then(response => {
           if (response.ok) {
             alert('MQTT地址已更新！ / MQTT address updated!');
           } else {
             alert('设置失败，请检查输入值 / Failed to set MQTT address, please check the input value');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 切换MQTT控制 / Toggle MQTT control
     function toggleMQTTControl(enable) {
       const url = `/api/mqtt_control?enable=${enable}`;
       fetch(url)
         .then(response => {
           if (response.ok) {
             alert(enable ? 'MQTT控制已启用！' : 'MQTT控制已禁用！');
           } else {
             alert('操作失败，请检查设备状态 / Operation failed, please check device status');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 重新进入配网模式 / Reset WiFi configuration
     function resetWiFi() {
       fetch('/api/reset_wifi')
         .then(response => {
           if (response.ok) {
             alert('设备正在重新进入配网模式 / Device is restarting to enter configuration mode');
           } else {
             alert('操作失败，请检查设备状态 / Operation failed, please check device status');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }

