1314mjf521/ESP8266/src/main_V1.0.1.cpp
     // 加速电机 / Speed up motor
     function speedUpMotor() {
       fetch('/motor/speed_up')
         .then(response => {
           if (response.ok) {
             alert('电机加速成功！ / Motor speed increased successfully!');
           } else {
             alert('加速失败！ / Speed up failed!');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }

     // 减速电机 / Slow down motor
     function slowDownMotor() {
       fetch('/motor/slow_down')
         .then(response => {
           if (response.ok) {
             alert('电机减速成功！ / Motor speed decreased successfully!');
           } else {
             alert('减速失败！ / Slow down failed!');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     window.onload = loadDeviceInfo;
   </script>
 </head>
 <body>
   <h1>ESP8266 步进电机控制系统</h1>
   <div class="info">
     <p>设备IP地址: <strong id="ipAddress"></strong></p>
     <p>设备MAC地址: <strong id="macAddress"></strong></p>
     <p>固件版本: <strong id="version"></strong></p>
     <p>在线控制端数量: <strong id="onlineClients"></strong></p>
     <button onclick="location.href='/clients'">查看控制端信息</button>
   </div>
   <div class="button-group">
     <h2>电机控制</h2>
     <button onclick="fetch('/motor/on').then(() => alert('电机已开启！')).catch(() => alert('操作失败！'));">开启电机</button>
     <button onclick="fetch('/motor/off').then(() => alert('电机已关闭！')).catch(() => alert('操作失败！'));">关闭电机</button>
     <button onclick="fetch('/motor/direction').then(() => alert('电机方向已切换！')).catch(() => alert('操作失败！'));">切换电机方向</button>
     <button onclick="speedUpMotor()">加速</button>
     <button onclick="slowDownMotor()">减速</button>
   </div>
   <div class="button-group">
     <h2>设置电机启动时长</h2>
     <input type="number" id="motorDuration" placeholder="输入时长（秒）" min="1" max="1800" required>
     <button onclick="setMotorDuration()">设置时长</button>
   </div>
   <div class="button-group">
     <h2>设置 MQTT 地址</h2>
     <input type="text" id="mqttAddress" placeholder="输入MQTT服务器地址" required>
     <button onclick="setMQTTAddress()">更新地址</button>
   </div>
   <div class="button-group">
     <h2>MQTT 控制</h2>
     <button onclick="toggleMQTTControl(true)">启用 MQTT 控制</button>
     <button onclick="toggleMQTTControl(false)">禁用 MQTT 控制</button>
   </div>
   <div class="button-group">
     <h2>OTA 升级</h2>
     <button onclick="location.href='/ota'">开始OTA升级</button>
   </div>
   <div class="button-group">
     <h2>WiFi 配置</h2>
     <button onclick="resetWiFi()">重新进入配网模式</button>
   </div>
 </body>
 </html>
 )rawliteral";
 
 // 获取当前时间戳（毫秒） / Get current timestamp (milliseconds)
 unsigned long getTimestamp() {
   return millis();
 }
 
 // 更新电机活动时间戳 / Update motor activity timestamp
 void updateMotorActivity() {
   lastMotorActivityTime = millis();
   Serial.printf("[%lu] 电机活动时间已更新 / Motor activity timestamp updated\n", lastMotorActivityTime);
 }
 
 // 检查电机未使用超时 / Check motor inactivity timeout
 void checkMotorInactivity() {
   if (motorEnabled && (millis() - lastMotorActivityTime >= motorInactivityTimeout)) {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
     Serial.printf("[%lu] 电机因未使用超时已禁用 / Motor disabled due to inactivity timeout\n", millis());
   }
 }

// LED 状态变量 / LED state variables
bool ledState = LOW;
unsigned long lastLedToggleTime = 0;
const unsigned long ledBlinkInterval = 500; // LED 频闪间隔（毫秒） / LED blink interval (milliseconds)

// 更新 LED 状态的函数 / Function to update LED state
void updateLEDState() {
    unsigned long currentMillis = millis();

    // 如果 WiFi 已连接，LED 常亮 / If WiFi is connected, LED stays on
    if (WiFi.status() == WL_CONNECTED) {
        digitalWrite(LED_BUILTIN, LOW); // 常亮（低电平点亮） / LED on (active LOW)
        return;
    }

    // 如果 WiFi 未连接，LED 频闪 / If WiFi is not connected, LED blinks
    if (currentMillis - lastLedToggleTime >= ledBlinkInterval) {
        lastLedToggleTime = currentMillis;
        ledState = !ledState;
        digitalWrite(LED_BUILTIN, ledState ? LOW : HIGH); // 切换 LED 状态 / Toggle LED state
    }
}

// 初始化WiFi连接 / Initialize WiFi connection with fault tolerance
void initializeWiFi() {
    pinMode(LED_BUILTIN, OUTPUT); // 设置板载 LED 为输出模式 / Set onboard LED as output
    digitalWrite(LED_BUILTIN, HIGH); // 默认关闭 LED（高电平熄灭） / Default LED off (active LOW)

    WiFiManager wifiManager;
    wifiManager.setTimeout(180); // 设置智能配网超时时间为180秒 / Set smart configuration timeout to 180 seconds

    while (wifiConnectFailures < 3) {
        if (wifiManager.autoConnect("ESP8266_SmartConfig")) { // 设置配网热点名称 / Set WiFi configuration hotspot name
            Serial.println("WiFi连接成功 / WiFi connected");
            Serial.print("设备IP地址: / Device IP Address: ");
            Serial.println(WiFi.localIP());
            return;
        } else {
            wifiConnectFailures++;
            Serial.printf("WiFi连接失败，第%d次尝试 / WiFi connection failed, attempt %d\n", wifiConnectFailures, wifiConnectFailures);
            delay(10000); // 每次失败后等待10秒 / Wait 10 seconds after each failure
        }
    }

    // 超过3次失败后重新进入智能配网模式 / Enter smart configuration mode after 3 failures
    Serial.println("WiFi连接失败超过3次，进入智能配网模式 / WiFi connection failed more than 3 times, entering smart configuration mode");
    wifiManager.startConfigPortal("ESP8266_SmartConfig");
}
 
 // 初始化Web服务器 / Initialize web server
 void setupWebServer() {
   server.on("/", handleRoot);
   server.on("/motor/on", handleMotorOn); // 处理开启电机请求 / Handle motor on request
   server.on("/motor/off", handleMotorOff); //  处理关闭电机请求 / Handle motor off request
   server.on("/motor/direction", handleMotorDirection); // 处理切换电机方向请求 / Handle motor direction toggle request
   server.on("/motor/speed_up", handleSpeedUp); // 添加加速接口 / Add speed up endpoint
   server.on("/motor/slow_down", handleSlowDown); // 添加减速接口 / Add slow down endpoint
   server.on("/api/motor", handleMotorAPI); // 添加API接口处理 / Add API endpoint handling
   server.on("/api/register", handleRegisterController); // 添加注册控制端的API接口 / Add API endpoint for registering controllers
   server.on("/api/version", handleVersionInfo); // 添加获取版本信息的API接口 / Add API endpoint for getting version information
   server.on("/ota", handleOTA); // 添加OTA升级接口 / Add OTA upgrade endpoint
   server.on("/ota/upload", HTTP_POST, []() {}, handleOTAUpload); // OTA文件上传 / OTA file upload
   server.on("/ota/remote", HTTP_POST, handleOTARemote); // 远程OTA升级 / Remote OTA upgrade
   server.on("/api/mqtt_control", handleToggleMQTTControl); // 添加MQTT控制开关接口 / Add MQTT control toggle endpoint
   server.on("/api/device_info", handleDeviceInfo); // 设备信息接口 / Device info API
   server.on("/api/set_motor_duration", handleSetMotorRunDuration); // 添加设置电机启动时长接口 / Add motor run duration API
   server.on("/api/set_mqtt", handleSetMQTTAddress); // 修复未注册的接口 / Fix unregistered endpoint
   server.on("/clients", handleClientsPage); // 控制端信息页面 / Client info page
   server.on("/api/set_client_name", handleSetClientName); // 设置控制端名称接口 / Set client name API
   server.on("/api/reset_wifi", handleResetWiFi); // 新增重新配网接口 / Add reset WiFi API
   server.begin();
   Serial.println("Web服务器已启动 / Web server started");
 }
 
// 定义步进电机脉冲信号的最小和最大间隔（微秒） / Define min and max pulse intervals (microseconds)
const unsigned long minStepPulseInterval = 500;  // 最快速度（2kHz） / Fastest speed (2kHz)
const unsigned long maxStepPulseInterval = 5000; // 最慢速度（200Hz） / Slowest speed (200Hz)
unsigned long stepPulseInterval = 1000;          // 当前脉冲间隔（默认1kHz） / Current pulse interval (default 1kHz)
unsigned long lastStepTime = 0;                  // 上次发送脉冲的时间戳 / Last pulse timestamp

// 步进电机参数
const int STEPS_PER_REV = 200; // 42步进电机一圈200步（1.8度/步）
const int MICROSTEPS = 16;     // A4988最大细分16
const int MOTOR_RPM = 60;      // 默认转速，可根据需要调整
const int PULSES_PER_REV = STEPS_PER_REV * MICROSTEPS; // 每圈脉冲数（用于转速计算）

