1314mjf521/ESP8266/src/main_V1.0.1.cpp
// 步进电机速度参数
unsigned int stepInterval = 200; // 默认脉冲间隔（us），对应5kHz，适合细分
const unsigned int stepIntervalMin = 50;   // 最快（20kHz）
const unsigned int stepIntervalMax = 2000; // 最慢（500Hz）
bool stepDir = true; // true: HIGH, false: LOW

// 步进电机加减速状态
volatile bool accelerating = false;
volatile bool decelerating = false;

// 步进电机方向
// motorDirection 变量已存在，true=HIGH正转，false=LOW反转

// 步进电机运行状态
// motorEnabled 变量已存在

// 步进脉冲定时
unsigned long lastStepMicros = 0;

// BasicStepperDriver对象
BasicStepperDriver stepper(STEPS_PER_REV, DIR_PIN, STEP_PIN, ENABLE_PIN);

// 步进电机单步函数（参考你提供的可运行代码，脉冲宽度35us，直接输出）
void stepMotorOnce() {
    digitalWrite(STEP_PIN, HIGH);
    delayMicroseconds(35);
    digitalWrite(STEP_PIN, LOW);
    delayMicroseconds(35);
}

// 步进电机持续运行函数（使用BasicStepperDriver库）
void runStepper() {
    static unsigned long lastStepTime = 0;
    if (!motorEnabled) {
        stepper.disable();
        return;
    }
    stepper.enable();
    unsigned long now = micros();
    if (now - lastStepTime >= stepInterval) {
        lastStepTime = now;
        // 单步控制，方向由 stepDir 决定
        stepper.move(stepDir ? 1 : -1);
    }
}

// 加速/减速接口（直接调整stepInterval，适配BasicStepperDriver库）
void adjustMotorSpeed(bool increase) {
    // stepInterval 越小，速度越快
    if (increase) {
        if (stepInterval > stepIntervalMin) stepInterval -= 10;
        if (stepInterval < stepIntervalMin) stepInterval = stepIntervalMin;
    } else {
        if (stepInterval < stepIntervalMax) stepInterval += 10;
        if (stepInterval > stepIntervalMax) stepInterval = stepIntervalMax;
    }
    // 计算当前转速（转/秒）
    float rps = 1000000.0f / (stepInterval * PULSES_PER_REV);
    Serial.printf("当前脉冲间隔: %u us, 约 %.2f 转/秒\n", stepInterval, rps);
}

// 初始化函数 / Initialization function
void setup() {
    Serial.begin(115200);
    Serial.println("ESP8266 步进电机控制系统启动");
    Serial.printf("请确保A4988的MS1/MS2/MS3全部为高电平，已设置为16细分，脉冲/圈=%d\n", PULSES_PER_REV);
    pinMode(DIR_PIN, OUTPUT);
    pinMode(STEP_PIN, OUTPUT);
    pinMode(ENABLE_PIN, OUTPUT);
    digitalWrite(ENABLE_PIN, HIGH); // 默认关闭电机
    // ...existing code...
    stepper.begin(MOTOR_RPM, MICROSTEPS);
    stepper.setEnableActiveState(LOW); // A4988 EN低电平有效
    stepper.enable();
   // 打印版本信息 / Print version information
   Serial.println("ESP8266 步进电机远程控制系统 / ESP8266 Stepper Motor Remote Control System");
   Serial.println("固件版本: " FIRMWARE_VERSION " / Firmware Version: " FIRMWARE_VERSION);
 
   pinMode(DIR_PIN, OUTPUT);
   pinMode(STEP_PIN, OUTPUT);
   pinMode(ENABLE_PIN, OUTPUT);
   digitalWrite(ENABLE_PIN, HIGH); // 默认关闭电机 / Default to motor off
 
   // 初始化物理按钮引脚 / Initialize physical button pins
   pinMode(MOTOR_BUTTON_PIN, INPUT_PULLUP); // 初始化电机按钮引脚 / Initialize motor button pin
   Serial.println("电机按钮初始化完成 / Motor button initialized");
 
   pinMode(BUTTON_DIRECTION_PIN, INPUT_PULLUP); // 使用内部上拉电阻 / Use internal pull-up resistor
   Serial.println("物理按钮初始化完成 / Physical buttons initialized");
 
   // 初始化WiFi连接 / Initialize WiFi connection
   initializeWiFi();
 
   // 加载保存的MQTT地址
   loadMQTTAddress(); // 加载保存的MQTT地址
   client.setServer(mqtt_server, 1883); // 设置MQTT服务器地址
 
   // 初始化MQTT / Initialize MQTT
   client.setCallback(mqttCallback); // 设置MQTT回调函数 / Set MQTT callback function
 
   // 初始化Web服务器 / Initialize web server
   setupWebServer();
 
   // 初始化OTA / Initialize OTA
   ArduinoOTA.onStart([]() {
     String type = ArduinoOTA.getCommand() == U_FLASH ? "sketch" : "filesystem";
     Serial.println("开始OTA更新: " + type + " / Starting OTA update: " + type);
   });
   ArduinoOTA.onEnd([]() {
     Serial.println("\nOTA更新完成 / OTA update completed");
   });
   ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
     // 修复格式化字符串问题 / Fix format string issue
     Serial.printf("OTA更新进度: %u%%\r / OTA update progress: %u%%\r", progress * 100 / total, progress * 100 / total);
   });
   ArduinoOTA.onError([](ota_error_t error) {
     // 修复格式化字符串问题 / Fix format string issue
     Serial.printf("OTA更新错误[%u]: / OTA update error [%u]: ", static_cast<unsigned int>(error), static_cast<unsigned int>(error));
     if (error == OTA_AUTH_ERROR) {
       Serial.println("认证失败 / Authentication failed");
     } else if (error == OTA_BEGIN_ERROR) {
       Serial.println("开始失败 / Begin failed");
     } else if (error == OTA_CONNECT_ERROR) {
       Serial.println("连接失败 / Connection failed");
     } else if (error == OTA_RECEIVE_ERROR) {
       Serial.println("接收失败 / Receive failed");
     } else if (error == OTA_END_ERROR) {
       Serial.println("结束失败 / End failed");
     }
   }); // 修复结束符号 / Fix closing brace
   ArduinoOTA.begin();
   Serial.println("OTA功能已启动 / OTA functionality started");
}
 
// 主循环 / Main loop
void loop() {
  updateLEDState(); // 更新 LED 状态 / Update LED state
  handleMotorButton(); // 处理电机按钮逻辑 / Handle motor button logic
  handleMotorRunDuration(); // 处理电机运行时长逻辑 / Handle motor run duration logic
  checkMotorInactivity(); // 检查电机未使用超时 / Check motor inactivity timeout

  // 更新电机步进脉冲信号 / Update motor step pulse signal
  runStepper();

  // 检查物理按钮状态 / Check physical button states
  handlePhysicalButtons();

  // 检查MQTT连接状态，仅在启用时检测 / Check MQTT connection status only when enabled
  if (mqttControlEnabled) {
    if (!client.connected()) {
      reconnectMQTT(); // 尝试重新连接MQTT / Attempt to reconnect to MQTT
    }
    client.loop(); // 处理MQTT消息 / Handle MQTT messages
  } else {
    // 如果禁用MQTT控制，确保不会尝试连接或处理消息 / Ensure no connection or message handling when disabled
    static bool mqttDisabledLogged = false;
    if (!mqttDisabledLogged) {
      Serial.println("MQTT控制已禁用，跳过MQTT检测 / MQTT control disabled, skipping MQTT checks");
      mqttDisabledLogged = true;
    }
  }

  server.handleClient(); // 处理网页请求 / Handle web requests
  ArduinoOTA.handle(); // 处理OTA更新 / Handle OTA updates
}

// 处理加速请求 / Handle speed up request
void handleSpeedUp() {
  adjustMotorSpeed(true); // 加速 / Increase speed
  server.send(200, "text/plain; charset=utf-8", "电机加速 / Motor speed increased");
}

// 处理减速请求 / Handle slow down request
void handleSlowDown() {
  adjustMotorSpeed(false); // 减速 / Decrease speed
  server.send(200, "text/plain; charset=utf-8", "电机减速 / Motor speed decreased");
}
 
// 合并重复的 mqttCallback 函数定义 / Merge duplicate mqttCallback definitions
void mqttCallback(char* topic, byte* payload, unsigned int length) {
    if (!mqttControlEnabled) {
        Serial.printf("[%lu] MQTT控制已禁用，忽略消息 / MQTT control disabled, ignoring message\n", millis());
        return;
    }
    String message;
    for (unsigned int i = 0; i < length; i++) {
        message += (char)payload[i];
    }
    Serial.printf("收到 MQTT 消息，主题: %s，内容: %s\n", topic, message.c_str());

    // 处理电机控制主题的消息 / Handle motor control topic messages
    if (String(topic) == mqtt_topic_motor_control) {
        if (message == "forward") {
            digitalWrite(DIR_PIN, HIGH); // 设置为正向运动 / Set to forward
            digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
            Serial.println("电机正向运动（通过 MQTT） / Motor moving forward (via MQTT)");
        } else if (message == "reverse") {
            digitalWrite(DIR_PIN, LOW); // 设置为反向运动 / Set to reverse
            digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
            Serial.println("电机反向运动（通过 MQTT） / Motor moving reverse (via MQTT)");
        } else if (message == "off") {
            digitalWrite(ENABLE_PIN, HIGH); // 停止电机 / Disable motor
            Serial.println("电机停止（通过 MQTT） / Motor stopped (via MQTT)");
        }
    }

    // 如果有其他主题需要处理，可以在这里扩展逻辑 / Extend logic here for other topics
    else {
        Serial.printf("未处理的 MQTT 主题: %s\n", topic);
    }
}
 
 // 处理物理按钮逻辑 / Handle physical button logic
 void handlePhysicalButtons() {
   // 读取电机方向按钮状态 / Read motor direction button state
   bool currentDirectionButtonState = digitalRead(BUTTON_DIRECTION_PIN);
   if (currentDirectionButtonState != lastDirectionButtonState) {
     if (currentDirectionButtonState == LOW) { // 按钮被按下 / Button pressed
       motorDirection = !motorDirection; // 切换电机方向 / Toggle motor direction
       stepDir = motorDirection;
       digitalWrite(DIR_PIN, stepDir ? HIGH : LOW); // 控制电机方向引脚 / Control motor direction pin
       Serial.printf("[%lu] 电机方向已切换为: %s（通过按钮） / Motor direction toggled to: %s (via button)\n", millis(), motorDirection ? "正转 / Forward" : "反转 / Reverse", motorDirection ? "正转 / Forward" : "反转 / Reverse");
     }
     lastDebounceTime = millis(); // 更新防抖时间戳 / Update debounce timestamp
   }
   lastDirectionButtonState = currentDirectionButtonState;
 }
 
 // 处理电机启动逻辑 / Handle motor start logic
 void startMotor() {
   if (motorEnabled) {
     motorStartTime = millis(); // 记录启动时间 / Record start time
     digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
     Serial.printf("[%lu] 电机启动 / Motor started\n", getTimestamp());
   }
 }
 
 // 修改电机按钮逻辑，增加方向引脚判断 / Modify motor button logic to include direction pin check
void handleMotorButton() {
    // 读取按钮状态 / Read button state
    bool currentMotorButtonState = digitalRead(MOTOR_BUTTON_PIN);
    bool currentDirectionButtonState = digitalRead(BUTTON_DIRECTION_PIN);

    // 检测按钮状态变化并处理防抖 / Detect button state change and handle debounce
    if (currentMotorButtonState != lastMotorButtonState) {
        lastMotorButtonDebounceTime = millis(); // 更新防抖时间戳 / Update debounce timestamp
    }

    // 如果按钮状态稳定超过防抖延迟 / If button state is stable beyond debounce delay
    if ((millis() - lastMotorButtonDebounceTime) > motorButtonDebounceDelay) {
        if (currentMotorButtonState == LOW) { // 如果按钮被按下 / If button is pressed
            updateMotorActivity(); // 更新电机活动时间戳 / Update motor activity timestamp
            if (motorEnabled) {
                // 如果电机已开启，检查方向引脚状态 / If motor is enabled, check direction pin state
                if (currentDirectionButtonState == HIGH) {
                    motorEnabled = false;
                    digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
                    Serial.printf("[%lu] 电机已关闭（通过按钮） / Motor disabled (via button)\n", millis());
                } else {
                    // 限位触发，准备反转运行 / Limit triggered, prepare for reverse
                    motorDirection = !motorDirection; // 切换电机方向 / Toggle motor direction
                    stepDir = motorDirection;
                    digitalWrite(DIR_PIN, stepDir ? HIGH : LOW); // 设置方向引脚 / Set direction pin
                    Serial.printf("[%lu] 限位触发，电机方向已切换为: %s / Limit triggered, motor direction toggled to: %s\n",
                                  millis(), motorDirection ? "正转 / Forward" : "反转 / Reverse",
                                  motorDirection ? "正转 / Forward" : "反转 / Reverse");
                }
            } else {
                // 如果电机关闭，启动电机 / If motor is disabled, enable the motor
                motorEnabled = true;
                motorStartTime = millis(); // 记录启动时间 / Record start time
                digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
                Serial.printf("[%lu] 电机已开启（通过按钮） / Motor enabled (via button)\n", millis());
            }
        }
    }

