1314mjf521/ESP8266/src/main_V1.0.1.cpp
 // 处理启用或禁用MQTT控制的请求 / Handle enable or disable MQTT control
 void handleToggleMQTTControl() {
   if (server.hasArg("enable")) {
     String enable = server.arg("enable");
     if (enable == "true") {
       mqttControlEnabled = true;
       client.setServer(mqtt_server, 1883); // 设置MQTT服务器地址 / Set MQTT server address
       Serial.println("MQTT控制已启用 / MQTT control enabled");
       server.send(200, "text/plain; charset=utf-8", "MQTT控制已启用 / MQTT control enabled");
     } else if (enable == "false") {
       mqttControlEnabled = false;
       client.unsubscribe(mqtt_topic_motor_control); // 取消订阅主题 / Unsubscribe from topic
       client.disconnect(); // 禁用时断开MQTT连接 / Disconnect MQTT when disabled
       Serial.println("MQTT控制已禁用 / MQTT control disabled");
       server.send(200, "text/plain; charset=utf-8", "MQTT控制已禁用 / MQTT control disabled");
     } else {
       server.send(400, "text/plain; charset=utf-8", "无效参数 / Invalid parameter");
       Serial.println("无效的MQTT控制参数 / Invalid MQTT control parameter");
     }
   } else {
     server.send(400, "text/plain; charset=utf-8", "缺少参数 / Missing parameter");
     Serial.println("缺少MQTT控制参数 / Missing MQTT control parameter");
   }
 }
 
 // 处理设备信息请求 / Handle device info request
 void handleDeviceInfo() {
   String deviceInfo = "{";
   deviceInfo += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
   deviceInfo += "\"mac\":\"" + WiFi.macAddress() + "\",";
   deviceInfo += "\"version\":\"" + String(FIRMWARE_VERSION) + "\",";
   deviceInfo += "\"onlineClients\":" + String(clients.size());
   deviceInfo += "}";
   server.send(200, "application/json", deviceInfo);
 }
 
 // 处理设置电机启动时长的网页请求 / Handle web request to set motor run duration
 void handleSetMotorRunDuration() {
   if (server.hasArg("duration")) {
     int duration = server.arg("duration").toInt();
     if (duration >= 1 && duration <= 1800) { // 范围：1秒到30分钟 / Range: 1 second to 30 minutes
       motorRunDuration = duration * 1000; // 转换为毫秒 / Convert to milliseconds
       server.send(200, "text/plain; charset=utf-8", "电机启动时长已更新 / Motor run duration updated");
       Serial.printf("电机启动时长设置为: %d 秒 / Motor run duration set to: %d seconds\n", duration, duration);
     } else {
       server.send(400, "text/plain; charset=utf-8", "无效的时长，范围为1到1800秒 / Invalid duration, range is 1 to 1800 seconds");
       Serial.println("设置电机启动时长失败：无效的时长 / Failed to set motor run duration: Invalid duration");
     }
   } else {
     server.send(400, "text/plain; charset=utf-8", "缺少时长参数 / Missing duration parameter");
     Serial.println("设置电机启动时长失败：缺少时长参数 / Failed to set motor run duration: Missing duration parameter");
   }
 }
 
 // 处理控制端信息页面请求 / Handle client info page request
 void handleClientsPage() {
   String html = R"rawliteral(
     <!DOCTYPE html>
     <html>
     <head>
       <meta charset="UTF-8">
       <title>控制端设备信息</title>
       <style>
         body { font-family: Arial, sans-serif; text-align: center; margin: 20px; }
         table { margin: 20px auto; border-collapse: collapse; width: 80%; }
         th, td { border: 1px solid #ddd; padding: 8px; text-align: center; }
         th { background-color: #4CAF50; color: white; }
         tr:nth-child(even) { background-color: #f2f2f2; }
         tr:hover { background-color: #ddd; }
         .back-button {
           margin-top: 20px;
           padding: 10px 20px;
           font-size: 16px;
           color: white;
           background-color: #4CAF50;
           border: none;
           border-radius: 5px;
           box-shadow: 0 4px 6px rgba(0, 0, 0, 0.1);
           cursor: pointer;
           transition: background-color 0.3s, box-shadow 0.3s;
         }
         .back-button:hover {
           background-color: #45a049;
           box-shadow: 0 6px 8px rgba(0, 0, 0, 0.15);
         }
       </style>
     </head>
     <body>
       <h1>控制端设备信息</h1>
       <table>
         <tr>
           <th>设备名称</th>
           <th>MAC 地址</th>
         </tr>
   )rawliteral";
 
   // 遍历控制端信息并生成表格行 / Iterate over clients and generate table rows
   for (const auto& client : clients) {
     html += "<tr><td>" + client.second + "</td><td>" + client.first + "</td></tr>";
   }
 
   html += R"rawliteral(
       </table>
       <button class="back-button" onclick="location.href='/'">返回主页面</button>
     </body>
     </html>
   )rawliteral";
 
   server.send(200, "text/html", html);
 }
 
 // 处理设置控制端名称的请求 / Handle set client name request
 void handleSetClientName() {
   if (server.hasArg("mac") && server.hasArg("name")) {
     String mac = server.arg("mac");
     String name = server.arg("name");
     clients[mac] = name; // 更新或添加控制端信息 / Update or add client info
     server.send(200, "text/plain", "控制端名称已更新 / Client name updated");
     Serial.printf("控制端名称已更新: MAC=%s, 名称=%s\n", mac.c_str(), name.c_str());
   } else {
     server.send(400, "text/plain", "缺少参数 / Missing parameters");
   }
 }
 
 // 更新控制端在线状态 / Update client online status
 void updateClientOnlineStatus(String mac) {
   if (clients.find(mac) == clients.end()) {
     clients[mac] = "默认名称"; // 如果未设置名称，使用默认名称 / Use default name if not set
   }
   Serial.printf("控制端在线: MAC=%s\n", mac.c_str());
 }
 
 // 处理重新配网请求 / Handle reset WiFi request
 void handleResetWiFi() {
   Serial.println("收到重新配网请求，准备进入智能配网模式 / Received reset WiFi request, preparing to enter smart configuration mode");
   server.send(200, "text/plain; charset=utf-8", "设备正在重新进入配网模式，请稍候... / Device is restarting to enter configuration mode, please wait...");
   delay(1000); // 延迟以确保响应发送完成 / Delay to ensure the response is sent
   WiFi.disconnect(); // 断开WiFi连接 / Disconnect WiFi
   Serial.println("WiFi已断开，设备即将重启 / WiFi disconnected, device will restart");
   ESP.restart(); // 重启设备以进入智能配网模式 / Restart device to enter smart configuration mode
 }



